In [1]:
import pandas as pd
import numpy as np

# Carregando dados
- Dados de compra
- Dados dos produtos

In [2]:
janeiro = pd.read_csv('dados_vendas/Sales_January_2019.csv', sep=',')
fevereiro = pd.read_csv('dados_vendas/Sales_February_2019.csv', sep=',')
marco = pd.read_csv('dados_vendas/Sales_March_2019.csv', sep=',')
abril = pd.read_csv('dados_vendas/Sales_April_2019.csv', sep=',')
maio = pd.read_csv('dados_vendas/Sales_May_2019.csv', sep=',')
junho = pd.read_csv('dados_vendas/Sales_June_2019.csv', sep=',')
julho = pd.read_csv('dados_vendas/Sales_July_2019.csv', sep=',')
agosto = pd.read_csv('dados_vendas/Sales_August_2019.csv', sep=',')
setembro = pd.read_csv('dados_vendas/Sales_September_2019.csv', sep=',')
outubro = pd.read_csv('dados_vendas/Sales_October_2019.csv', sep=',')
novembro = pd.read_csv('dados_vendas/Sales_November_2019.csv', sep=',')
dezembro = pd.read_csv('dados_vendas/Sales_December_2019.csv', sep=',')
produtos = pd.read_csv('dados_vendas/products.csv')

# Analisando os data frames de compras
- Abrimos os arquivos .csv dos meses de janeiro e fevereiro;
- Verificamos se os arquivos de julho e dezembro seguiam a mesma estrutura de colunas;
- Fica claro que há um padrão de colunas, podendo assim serem unidos, sem muitas preocupações;

In [3]:
janeiro.head()

,Order ID,Product ID,Quantity Ordered,Order Date,Purchase Address
0,141234,21,1,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,8,1,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,10,2,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,3,1,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,10,1,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [4]:
fevereiro.head()

,Order ID,Product ID,Quantity Ordered,Order Date,Purchase Address
0,150502,21,1,02/18/19 01:35,"866 Spruce St, Portland, ME 04101"
1,150503,4,1,02/13/19 07:24,"18 13th St, San Francisco, CA 94016"
2,150504,17,1,02/18/19 09:46,"52 6th St, New York City, NY 10001"
3,150505,8,1,02/02/19 16:47,"129 Cherry St, Atlanta, GA 30301"
4,150506,4,2,02/28/19 20:32,"548 Lincoln St, Seattle, WA 98101"

In [5]:
janeiro.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          9697 non-null   object
 1   Product ID        9723 non-null   int64
 2   Quantity Ordered  9697 non-null   object
 3   Order Date        9697 non-null   object
 4   Purchase Address  9697 non-null   object
dtypes: int64(1), object(4)
memory usage: 379.9+ KB

In [6]:
julho.columns

Index(['Order ID', 'Product ID', 'Quantity Ordered', 'Order Date',
       'Purchase Address'],
      dtype='object')

In [7]:
dezembro.columns

Index(['Order ID', 'Product ID', 'Quantity Ordered', 'Order Date',
       'Purchase Address'],
      dtype='object')

# Unificando arquivos .csv de compra

In [8]:
vendas_2019 = pd.concat([janeiro, fevereiro, marco, abril, maio, junho, julho, agosto, setembro, outubro, novembro, dezembro], axis= 0)

In [9]:
vendas_2019.info

<bound method DataFrame.info of       Order ID  Product ID Quantity Ordered      Order Date  \
0       141234          21                1  01/22/19 21:25
1       141235           8                1  01/28/19 14:15
2       141236          10                2  01/17/19 13:33
3       141237           3                1  01/05/19 20:33
4       141238          10                1  01/25/19 11:59
...        ...         ...              ...             ...
25112   319666           8                1  12/11/19 20:58
25113   319667           4                2  12/01/19 12:01
25114   319668          26                1  12/09/19 06:43
25115   319669          10                1  12/03/19 10:39
25116   319670           5                1  12/21/19 21:45

                             Purchase Address
0             944 Walnut St, Boston, MA 02215
1            185 Maple St, Portland, OR 97035
2       538 Adams St, San Francisco, CA 94016
3          738 10th St, Los Angeles, CA 90001
4               387 10th St, Austin, TX 73301
...                                       ...
25112  14 Madison St, San Francisco, CA 94016
25113    549 Willow St, Los Angeles, CA 90001
25114        273 Wilson St, Seattle, WA 98101
25115          778 River St, Dallas, TX 75001
25116  747 Chestnut St, Los Angeles, CA 90001

[186850 rows x 5 columns]>

# Tratando os dados de compra
- Criamos uma mascara booleana para identificar os valores nulos;
- Utilizamos o comando .value_counts() para identificar o número de valores nulos;
- Separamos por tanto todas os pedidos sem a identificação de pedido (Order ID);
- Após uma breve análise podemos identificar que todos as transações do produto com "Product ID" = 19 encontram-se sem Order ID;
- Deve ser reportado o erro para posterior análise;
- Sabendo que todos os valores nulos rastreados, invertemos a mascara booleana e criamos uma nova seleção exclusiva para valores validos;

In [10]:
valores_nulos = vendas_2019.isnull()

In [11]:
valores_nulos.tail()

       Order ID  Product ID  Quantity Ordered  Order Date  Purchase Address
25112     False       False             False       False             False
25113     False       False             False       False             False
25114     False       False             False       False             False
25115     False       False             False       False             False
25116     False       False             False       False             False

In [12]:
valores_nulos['Order ID'].value_counts()

False    186305
True        545
Name: Order ID, dtype: int64

In [13]:
selecao = valores_nulos['Order ID']
sem_order_id = vendas_2019[selecao]

In [14]:
sem_order_id.head()

     Order ID  Product ID Quantity Ordered Order Date Purchase Address
664       NaN          19              NaN        NaN              NaN
678       NaN          19              NaN        NaN              NaN
797       NaN          19              NaN        NaN              NaN
876       NaN          19              NaN        NaN              NaN
1299      NaN          19              NaN        NaN              NaN

In [15]:
sem_order_id.info
# Temos 545 registros núlos

<bound method DataFrame.info of       Order ID  Product ID Quantity Ordered Order Date Purchase Address
664        NaN          19              NaN        NaN              NaN
678        NaN          19              NaN        NaN              NaN
797        NaN          19              NaN        NaN              NaN
876        NaN          19              NaN        NaN              NaN
1299       NaN          19              NaN        NaN              NaN
...        ...         ...              ...        ...              ...
22945      NaN          19              NaN        NaN              NaN
22962      NaN          19              NaN        NaN              NaN
23309      NaN          19              NaN        NaN              NaN
23996      NaN          19              NaN        NaN              NaN
24730      NaN          19              NaN        NaN              NaN

[545 rows x 5 columns]>

In [16]:
sem_order_id['Product ID'].unique()
# só temos itens com valor nulo com Product ID = 19

array([19], dtype=int64)

In [17]:
vendas_2019['Product ID'].value_counts()
# Product ID = 19 = 545 Registros

2     21903
8     21658
6     20641
4     20577
10    18882
23    15549
5     13325
3      7507
21     6842
17     6230
15     6181
25     5525
24     4800
22     4724
7      4128
14     4101
26     2065
1       666
20      646
19      545
18      355
Name: Product ID, dtype: int64

In [18]:
com_order_id = vendas_2019[~selecao]

In [19]:
com_order_id.info

<bound method DataFrame.info of       Order ID  Product ID Quantity Ordered      Order Date  \
0       141234          21                1  01/22/19 21:25
1       141235           8                1  01/28/19 14:15
2       141236          10                2  01/17/19 13:33
3       141237           3                1  01/05/19 20:33
4       141238          10                1  01/25/19 11:59
...        ...         ...              ...             ...
25112   319666           8                1  12/11/19 20:58
25113   319667           4                2  12/01/19 12:01
25114   319668          26                1  12/09/19 06:43
25115   319669          10                1  12/03/19 10:39
25116   319670           5                1  12/21/19 21:45

                             Purchase Address
0             944 Walnut St, Boston, MA 02215
1            185 Maple St, Portland, OR 97035
2       538 Adams St, San Francisco, CA 94016
3          738 10th St, Los Angeles, CA 90001
4               387 10th St, Austin, TX 73301
...                                       ...
25112  14 Madison St, San Francisco, CA 94016
25113    549 Willow St, Los Angeles, CA 90001
25114        273 Wilson St, Seattle, WA 98101
25115          778 River St, Dallas, TX 75001
25116  747 Chestnut St, Los Angeles, CA 90001

[186305 rows x 5 columns]>

In [20]:
186850 - 186305
# a diferença de linhas entre vendas2019 e o data frame com a mascara aplicada é igual ao número de dados faltantes,
# então está correto

545

# Organizando dados de compras
- Podemos ver que o arquivo contem data e horario na mesma coluna
- Para que seja possivel a futura análise devemos a data do horário;
- Criamos variaveis auxiliares para o armazenamento de datas e horas;
- Removemos a coluna com as informações aglomeradas;
- Inserimos as colunas de data e hora no dataframe;

In [21]:
com_order_id.head()

,Order ID,Product ID,Quantity Ordered,Order Date,Purchase Address
0,141234,21,1,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,8,1,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,10,2,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,3,1,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,10,1,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [22]:
data_hora = com_order_id['Order Date'].apply(lambda x: x.split(' '))
data_hora.head()

0    [01/22/19, 21:25]
1    [01/28/19, 14:15]
2    [01/17/19, 13:33]
3    [01/05/19, 20:33]
4    [01/25/19, 11:59]
Name: Order Date, dtype: object

In [23]:
hora = data_hora.apply(lambda x: x[1])
hora.rename('Invoice hour', inplace = True) #Horario da fatura
hora.head()

0    21:25
1    14:15
2    13:33
3    20:33
4    11:59
Name: Invoice hour, dtype: object

In [24]:
data = data_hora.apply(lambda x: x[0])
data.rename('Order Date', inplace = True) #Dia do pedido
data.head()

0    01/22/19
1    01/28/19
2    01/17/19
3    01/05/19
4    01/25/19
Name: Order Date, dtype: object

In [25]:
com_order_id.drop(['Order Date'], axis= 1, inplace= True)

C:\Users\cesar\Anaconda3\lib\site-packages\pandas\core\frame.py:3990: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [26]:
com_order_id

,Order ID,Product ID,Quantity Ordered,Purchase Address
0,141234,21,1,"944 Walnut St, Boston, MA 02215"
1,141235,8,1,"185 Maple St, Portland, OR 97035"
2,141236,10,2,"538 Adams St, San Francisco, CA 94016"
3,141237,3,1,"738 10th St, Los Angeles, CA 90001"
4,141238,10,1,"387 10th St, Austin, TX 73301"
...,...,...,...,...
25112,319666,8,1,"14 Madison St, San Francisco, CA 94016"
25113,319667,4,2,"549 Willow St, Los Angeles, CA 90001"
25114,319668,26,1,"273 Wilson St, Seattle, WA 98101"
25115,319669,10,1,"778 River St, Dallas, TX 75001"
25116,319670,5,1,"747 Chestnut St, Los Angeles, CA 90001"

In [27]:
df_organizado = pd.concat([com_order_id, data, hora], axis= 1)

In [28]:
df_organizado.head()

,Order ID,Product ID,Quantity Ordered,Purchase Address,Order Date,Invoice hour
0,141234,21,1,"944 Walnut St, Boston, MA 02215",01/22/19,21:25
1,141235,8,1,"185 Maple St, Portland, OR 97035",01/28/19,14:15
2,141236,10,2,"538 Adams St, San Francisco, CA 94016",01/17/19,13:33
3,141237,3,1,"738 10th St, Los Angeles, CA 90001",01/05/19,20:33
4,141238,10,1,"387 10th St, Austin, TX 73301",01/25/19,11:59

# Analisando o dataframe de produtos
- Após uma breve análise não detectamos nenhuma anomalia nos dados de produtos;

In [29]:
produtos.head()

   id                Product Price Each
0   0     Macbook Pro Laptop       1700
1   1     LG Washing Machine      600.0
2   2   USB-C Charging Cable      11.95
3   3       27in FHD Monitor     149.99
4   4  AA Batteries (4-pack)       3.84

In [30]:
valores_nulos = produtos.isna()

In [31]:
valores_nulos['id'].value_counts()

False    27
Name: id, dtype: int64

In [32]:
valores_nulos['Product'].value_counts()

False    27
Name: Product, dtype: int64

In [33]:
valores_nulos['Price Each'].value_counts()

False    27
Name: Price Each, dtype: int64

# Relacionando dados de Produtos e Compras
- Renomeamos a coluna "id" para "Product ID" do dataframe products para que seja possivel realizar a relação com o dataframe de transações;
- Unificamos os dataframes a partir do comando .merge arquivos pela coluna comum "Product ID";
- Utilizamos o método a "left" para que todos os produtos constem na relação entre os dataframes;
- Unificarmos os dataframes e logo podemos notar a presença de dados nulos;

In [34]:
produtos.rename(columns = {'id': 'Product ID'}, inplace= True)
produtos

    Product ID                     Product  Price Each
0            0          Macbook Pro Laptop        1700
1            1          LG Washing Machine       600.0
2            2        USB-C Charging Cable       11.95
3            3            27in FHD Monitor      149.99
4            4       AA Batteries (4-pack)        3.84
5            5  Bose SoundSport Headphones       99.99
6            6      AAA Batteries (4-pack)        2.99
7            7             ThinkPad Laptop      999.99
8            8    Lightning Charging Cable       14.95
9            9                Google Phone         600
10          10            Wired Headphones       11.99
11          11    Apple Airpods Headphones         150
12          12             Vareebadd Phone         400
13          13                      iPhone         700
14          14                20in Monitor      109.99
15          15      34in Ultrawide Monitor      379.99
16          16               Flatscreen TV         300
17          17      27in 4K Gaming Monitor      389.99
18          18                     Product  Price Each
19          19                     MISSING     MISSING
20          20                    LG Dryer       600.0
21          21                      iPhone       700.0
22          22          Macbook Pro Laptop      1700.0
23          23    Apple Airpods Headphones       150.0
24          24               Flatscreen TV       300.0
25          25                Google Phone       600.0
26          26             Vareebadd Phone       400.0

In [35]:
df_relacionado = pd.merge(produtos, df_organizado, on='Product ID', how = 'left')
df_relacionado.head()

,Product ID,Product,Price Each,Order ID,Quantity Ordered,Purchase Address,Order Date,Invoice hour
0,0,Macbook Pro Laptop,1700,NaN,NaN,NaN,NaN,NaN
1,1,LG Washing Machine,600.0,141516,1,"382 Main St, Seattle, WA 98101",01/17/19,19:53
2,1,LG Washing Machine,600.0,141766,1,"530 Jackson St, Dallas, TX 75001",01/16/19,21:08
3,1,LG Washing Machine,600.0,142560,1,"433 Main St, Dallas, TX 75001",01/26/19,12:27
4,1,LG Washing Machine,600.0,142714,1,"972 12th St, San Francisco, CA 94016",01/01/19,13:15

# Realizando a limpeza final do conjunto
- Por termos utilizado o ".merge" tendo como referencia a coluna "Product ID"s do dataframe de produtos, sabemos que todos os itens irão constar na tabela unificada ou seja, sabendo que o dataframe anterior não possuia valores nulos, os mesmos podem ter sido gerados por produtos que não foram relacionados através do ".merge", provavelmente por não terem sido adquiridos neste intervalo de estudo;
- Listamos os Product Ids dos dataframes de transações e produtos para compararmos se há diferenças;
- Identificamos que os Product IDs 0, 9, 11, 12, 13, 16, 19 não existem nos dataframes de compras ou seja 7 itens, comprovando por tantoa  hipótese de que haveriam produtos não comprados neste intervalo, justificando os dados nulos gerados;
- Removemos por tanto todos os itens nulos do dataframe;

In [36]:
df_relacionado_nulos = df_relacionado.isnull()

In [37]:
df_relacionado_nulos['Order ID'].value_counts()

False    186305
True          7
Name: Order ID, dtype: int64

In [38]:
produtos_consumidos = df_organizado['Product ID'].unique()
len(produtos_consumidos)

20

In [39]:
produtos_existentes = produtos['Product ID'].unique()
len(produtos_existentes)

27

In [40]:
produtos_n_consumidos = []

for i in produtos_existentes:
    if i in produtos_consumidos:
        pass
    else:
        produtos_n_consumidos.append(i)
print(produtos_n_consumidos)

[0, 9, 11, 12, 13, 16, 19]

In [41]:
df_relacionado.dropna(inplace= True)

In [42]:
df_relacionado_nulos = df_relacionado.isnull()

In [43]:
df_relacionado_nulos['Order ID'].value_counts()

False    186305
Name: Order ID, dtype: int64

# Exportanto dados tratados

In [49]:
df_relacionado.to_csv('dados_vendas/Sales_2019.csv', sep = ',', index = False)

In [50]:
dados = pd.read_csv('dados_vendas/Sales_2019.csv', sep=',')

C:\Users\cesar\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (2,3,4) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [51]:
dados.head()

,Product ID,Product,Price Each,Order ID,Quantity Ordered,Purchase Address,Order Date,Invoice hour
0,1,LG Washing Machine,600,141516,1,"382 Main St, Seattle, WA 98101",01/17/19,19:53
1,1,LG Washing Machine,600,141766,1,"530 Jackson St, Dallas, TX 75001",01/16/19,21:08
2,1,LG Washing Machine,600,142560,1,"433 Main St, Dallas, TX 75001",01/26/19,12:27
3,1,LG Washing Machine,600,142714,1,"972 12th St, San Francisco, CA 94016",01/01/19,13:15
4,1,LG Washing Machine,600,142939,1,"5 Spruce St, San Francisco, CA 94016",01/25/19,12:35